{
  "architectures": [
    "Mamba2ForCausalLM"
  ],
  "bos_token_id": 0,
  "chunk_size": 256,
  "conv_kernel": 4,
  "eos_token_id": 0,
  "expand": 3,
  "head_dim": 32,
  "hidden_act": "silu",
  "hidden_size": 256,
  "initializer_range": 0.1,
  "layer_norm_epsilon": 1e-05,
  "model_type": "mamba2",
  "n_groups": 8,
  "num_heads": 24,
  "num_hidden_layers": 12,
  "num_layer_groups": 1,
  "pad_token_id": 0,
  "rescale_prenorm_residual": false,
  "residual_in_fp32": true,
  "rms_norm": true,
  "state_size": 142,
  "tie_word_embeddings": false,
  "time_step_floor": 0.0001,
  "time_step_limit": [
    0.0,
    Infinity
  ],
  "time_step_max": 0.1,
  "time_step_min": 0.001,
  "time_step_rank": 256,
  "torch_dtype": "float32",
  "transformers_version": "4.51.3",
  "use_bias": false,
  "use_cache": true,
  "use_conv_bias": true,
  "use_embeddings": true,
  "use_modification": false,
  "vocab_size": 50280
}
